from utils.utils import PushableDict

# RecruitCharDefine ->gacha_table.json.gahaTags
ObtainDefine = ["先锋干员", "狙击干员", "医疗干员", "术师干员", "近卫干员", "重装干员", "辅助干员", "特种干员",
                "近战位", "远程位",
                "新手", "资深干员", "高级资深干员",
                "治疗", "支援", "输出", "群攻", "减速", "生存", "防护", "削弱",
                "位移", "控场", "爆发", "召唤", "快速复活", "费用回复", "支援机械"]

AkaRecruitDefine = PushableDict(ObtainDefine, base=list)
AkaRecruitDefine.update({
    "先锋干员": ["先锋"],
    "狙击干员": ["狙击", "远程狙"],
    "医疗干员": ["医疗", "医生"],
    "术师干员": ["术师", "术士"],
    "近卫干员": ["近卫"],
    "重装干员": ["重装"],
    "辅助干员": ["辅助"],
    "特种干员": ["特种"],
    "近战位": ['近战', "近身"],
    "远程位": ["远程", "高台", "高台位"],
    "高级资深干员": ["高姿", "高资", "6星", "6x", "高级资深"],
    "资深干员": ["资深", "5星", "5x"],
    "费用回复": ["回费", "攒费", "费用", "费用恢复", "恢费"],
    "快速复活": ["快活"],
    "支援机械": ["机械", "小车"]
})
for tag in ObtainDefine:
    AkaRecruitDefine.push(tag, tag, create=True)


class ProfDefine:
    # 近战位
    MELEE = "近战位"
    # 远程位
    RANGED = "远程位"
    # 先锋
    PIONEER = "先锋干员"
    # 狙击
    SNIPER = "狙击干员"
    # 医疗
    MEDIC = "医疗干员"
    # 术士
    CASTER = "术师干员"
    # 近卫
    WARRIOR = "近卫干员"
    # 重装
    TANK = "重装干员"
    # 辅助
    SUPPORT = "辅助干员"
    # 特种
    SPECIAL = "特种干员"
    # 召唤物
    TOKEN = "召唤物"
    # 陷阱
    TRAP = "陷阱;障碍"
    # 未知(留空，实际不存在)
    NONE = "未知"


# RecruitCharDefine ->gacha_table.json.recruitDetail
RecruitCharDefine = ["Lancet-2", "Castle-3", "THRM-EX",
                     "夜刀", "黑角", "巡林者", "杜林", "12F",
                     "安德切尔", "芬", "香草", "翎羽", "玫兰莎", "米格鲁", "克洛丝", "炎熔", "芙蓉", "安赛尔", "史都华德", "梓兰", "空爆", "月见夜", "泡普卡",
                     "斑点",
                     "艾丝黛尔", "夜烟", "远山", "杰西卡", "流星", "白雪", "清道夫", "红豆", "杜宾", "缠丸", "霜叶", "慕斯", "砾", "暗索", "末药", "调香师",
                     "角峰", "蛇屠箱", "古米", "地灵", "阿消", "猎蜂", "格雷伊", "苏苏洛", "桃金娘", "红云", "梅", "清流",
                     "因陀罗", "火神", "白面鸮", "凛冬", "德克萨斯", "幽灵鲨", "蓝毒", "白金", "陨星", "梅尔", "赫默", "华法琳", "临光", "红", "雷蛇",
                     "可颂", "普罗旺斯", "守林人", "崖心", "初雪", "真理", "狮蝎", "食铁兽", "夜魔", "诗怀雅", "格劳克斯", "星极", "送葬人","槐虎",
                     "能天使", "推进之王", "伊芙利特", "闪灵", "夜莺", "星熊", "塞雷娅", "银灰", "斯卡蒂", "陈", "黑", "赫拉格", "麦哲伦",'莫斯提马']
